# Introduction to Pandas

In [1]:
import pandas as pd

## Data Types in Pandas

There are two main data types in pandas.
Series and DataFrame.

In [5]:
# Series = 1-dimensional

In [4]:
series = pd.Series(["BMW", "Volvo", "Mercedes"])
series

0         BMW
1       Volvo
2    Mercedes
dtype: object

In [7]:
colors = pd.Series(["Black", "Red", "Green"])
colors

0    Black
1      Red
2    Green
dtype: object

In [6]:
# DataFrame = 2-dimensional

In [8]:
car_data = pd.DataFrame({
    "Car Make": series,
    "Color": colors
})
car_data

   Car Make  Color
0       BMW  Black
1     Volvo    Red
2  Mercedes  Green

In [10]:
# importing data

In [9]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
# exporting data

In [21]:
car_sales.to_csv("exported_car_sales.csv", index = False)

In [22]:
new_car_sales = pd.read_csv("exported_car_sales.csv")
new_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00